#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/a82f3bda-ba6d-465a-97ce-7979caf5c477/terraform-bin show -no-color tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.firewall[0].azurerm_firewall_application_rule_collection.azure_monitor has been deleted
  - resource "azurerm_firewall_application_rule_collection" "azure_monitor" {
      - id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Azure-Monitor-FQDNs" -> null
        name                = "Azure-Monitor-FQDNs"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.firewall[0].azurerm_firewall_application_rule_collection.core has been deleted
  - resource "azurerm_firewall_application_rule_collection" "core" {
      - id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Core-Dependencies-FQDNs" -> null
        name                = "Core-Dependencies-FQDNs"
        # (4 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.firewall[0].azurerm_firewall_application_rule_collection.windows_vm_devops has been deleted
  - resource "azurerm_firewall_application_rule_collection" "windows_vm_devops" {
      - id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Devops-VM-Dependencies-FQDNs" -> null
        name                = "Devops-VM-Dependencies-FQDNs"
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.firewall[0].azurerm_firewall_network_rule_collection.windows_vm_devops has been deleted
  - resource "azurerm_firewall_network_rule_collection" "windows_vm_devops" {
      - id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/networkRuleCollections/Windows-VM-Connectivity-Requirements" -> null
        name                = "Windows-VM-Connectivity-Requirements"
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurecaf_name.caf_name_hub_rg must be replaced
-/+ resource "azurecaf_name" "caf_name_hub_rg" {
      ~ id            = "akckvaegwemunepv" -> (known after apply)
        name          = "eslz2"
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-hub",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-hub-westus3-rg-eslz2" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_resource_group.hub must be replaced
-/+ resource "azurerm_resource_group" "hub" {
      ~ id       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2" -> (known after apply)
      ~ location = "westus3" -> "westus2" # forces replacement
      ~ name     = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement
        tags     = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
        }
    }

  # module.bastion[0].azurecaf_name.caf_name_bastion must be replaced
-/+ resource "azurecaf_name" "caf_name_bastion" {
      ~ id            = "wbujomtsfcqdpxod" -> (known after apply)
        name          = "eslz2"
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-hub",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-hub-westus3-vnet-eslz2" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.bastion[0].azurecaf_name.caf_name_pip must be replaced
-/+ resource "azurecaf_name" "caf_name_pip" {
      ~ id            = "paqdxwmbugcxjhhq" -> (known after apply)
        name          = "eslz2-bastion"
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-hub",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-hub-westus3-pip-eslz2-bastion" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.bastion[0].azurerm_bastion_host.bastion must be replaced
-/+ resource "azurerm_bastion_host" "bastion" {
      ~ dns_name               = "bst-17852899-7610-4883-86ff-84a3a485f96f.bastion.azure.com" -> (known after apply)
      ~ id                     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/bastionHosts/sec-baseline-1-hub-westus3-vnet-eslz2" -> (known after apply)
      ~ location               = "westus3" -> "westus2" # forces replacement
      ~ name                   = "sec-baseline-1-hub-westus3-vnet-eslz2" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name    = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement
        tags                   = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "bastion"
        }
        # (7 unchanged attributes hidden)

      ~ ip_configuration {
            name                 = "bastionHostIpConfiguration"
          ~ public_ip_address_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/publicIPAddresses/sec-baseline-1-hub-westus3-pip-eslz2-bastion" # forces replacement -> (known after apply) # forces replacement
          ~ subnet_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureBastionSubnet" # forces replacement -> (known after apply) # forces replacement
        }
    }

  # module.bastion[0].azurerm_public_ip.bastion_pip must be replaced
-/+ resource "azurerm_public_ip" "bastion_pip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/publicIPAddresses/sec-baseline-1-hub-westus3-pip-eslz2-bastion" -> (known after apply)
      ~ ip_address              = "20.163.49.112" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ location                = "westus3" -> "westus2" # forces replacement
      ~ name                    = "sec-baseline-1-hub-westus3-pip-eslz2-bastion" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name     = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement
        tags                    = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "bastion"
        }
      - zones                   = [] -> null
        # (6 unchanged attributes hidden)
    }

  # module.firewall[0].azurecaf_name.caf_name_firewall must be replaced
-/+ resource "azurecaf_name" "caf_name_firewall" {
      ~ id            = "dtqvqxowbnalaruk" -> (known after apply)
        name          = "eslz2"
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-hub",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-hub-westus3-fw-eslz2" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.firewall[0].azurecaf_name.caf_name_law[0] must be replaced
-/+ resource "azurecaf_name" "caf_name_law" {
      ~ id            = "lofxpwfygywepldl" -> (known after apply)
        name          = "eslz2"
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-hub",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-hub-westus3-log-eslz2" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.firewall[0].azurecaf_name.caf_name_pip must be replaced
-/+ resource "azurecaf_name" "caf_name_pip" {
      ~ id            = "ofhucdctoijllhdb" -> (known after apply)
        name          = "eslz2-fw"
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-hub",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-hub-westus3-pip-eslz2-fw" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.firewall[0].azurerm_firewall.firewall must be replaced
-/+ resource "azurerm_firewall" "firewall" {
      - dns_servers         = [] -> null
      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2" -> (known after apply)
      ~ location            = "westus3" -> "westus2" # forces replacement
      ~ name                = "sec-baseline-1-hub-westus3-fw-eslz2" # forces replacement -> (known after apply) # forces replacement
      - private_ip_ranges   = [] -> null
      ~ resource_group_name = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement
        tags                = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "firewall"
        }
      ~ threat_intel_mode   = "Alert" -> (known after apply)
      - zones               = [] -> null
        # (2 unchanged attributes hidden)

      ~ ip_configuration {
            name                 = "firewallIpConfiguration"
          ~ private_ip_address   = "10.242.0.4" -> (known after apply)
          ~ public_ip_address_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/publicIPAddresses/sec-baseline-1-hub-westus3-pip-eslz2-fw" -> (known after apply)
          ~ subnet_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureFirewallSubnet" # forces replacement -> (known after apply) # forces replacement
        }
    }

  # module.firewall[0].azurerm_firewall_application_rule_collection.azure_monitor will be created
  + resource "azurerm_firewall_application_rule_collection" "azure_monitor" {
      + action              = "Allow"
      + azure_firewall_name = (known after apply)
      + id                  = (known after apply)
      + name                = "Azure-Monitor-FQDNs"
      + priority            = 201
      + resource_group_name = (known after apply)

      + rule {
          + name             = "allow-azure-monitor"
          + source_addresses = [
              + "10.242.0.0/20",
              + "10.240.0.0/20",
            ]
          + target_fqdns     = [
              + "dc.applicationinsights.azure.com",
              + "dc.applicationinsights.microsoft.com",
              + "dc.services.visualstudio.com",
              + "*.in.applicationinsights.azure.com",
              + "live.applicationinsights.azure.com",
              + "rt.applicationinsights.microsoft.com",
              + "rt.services.visualstudio.com",
              + "*.livediagnostics.monitor.azure.com",
              + "*.monitoring.azure.com",
              + "agent.azureserviceprofiler.net",
              + "*.agent.azureserviceprofiler.net",
              + "*.monitor.azure.com",
            ]

          + protocol {
              + port = 443
              + type = "Https"
            }
        }
    }

  # module.firewall[0].azurerm_firewall_application_rule_collection.core will be created
  + resource "azurerm_firewall_application_rule_collection" "core" {
      + action              = "Allow"
      + azure_firewall_name = (known after apply)
      + id                  = (known after apply)
      + name                = "Core-Dependencies-FQDNs"
      + priority            = 200
      + resource_group_name = (known after apply)

      + rule {
          + name             = "allow-core-apis"
          + source_addresses = [
              + "10.242.0.0/20",
              + "10.240.0.0/20",
            ]
          + target_fqdns     = [
              + "management.azure.com",
              + "management.core.windows.net",
              + "login.microsoftonline.com",
              + "login.windows.net",
              + "login.live.com",
              + "graph.windows.net",
              + "graph.microsoft.com",
            ]

          + protocol {
              + port = 443
              + type = "Https"
            }
        }
      + rule {
          + name             = "allow-developer-services"
          + source_addresses = [
              + "10.242.0.0/20",
              + "10.240.0.0/20",
            ]
          + target_fqdns     = [
              + "github.com",
              + "*.github.com",
              + "*.nuget.org",
              + "*.blob.core.windows.net",
              + "*.githubusercontent.com",
              + "dev.azure.com",
              + "*.dev.azure.com",
              + "portal.azure.com",
              + "*.portal.azure.com",
              + "*.portal.azure.net",
              + "appservice.azureedge.net",
              + "*.azurewebsites.net",
              + "edge.management.azure.com",
              + "vstsagentpackage.azureedge.net",
            ]

          + protocol {
              + port = 443
              + type = "Https"
            }
        }
      + rule {
          + name             = "allow-certificate-dependencies"
          + source_addresses = [
              + "10.242.0.0/20",
              + "10.240.0.0/20",
            ]
          + target_fqdns     = [
              + "*.delivery.mp.microsoft.com",
              + "ctldl.windowsupdate.com",
              + "download.windowsupdate.com",
              + "mscrl.microsoft.com",
              + "ocsp.msocsp.com",
              + "oneocsp.microsoft.com",
              + "crl.microsoft.com",
              + "www.microsoft.com",
              + "*.digicert.com",
              + "*.symantec.com",
              + "*.symcb.com",
              + "*.d-trust.net",
            ]

          + protocol {
              + port = 80
              + type = "Http"
            }
        }
    }

  # module.firewall[0].azurerm_firewall_application_rule_collection.windows_vm_devops will be created
  + resource "azurerm_firewall_application_rule_collection" "windows_vm_devops" {
      + action              = "Allow"
      + azure_firewall_name = (known after apply)
      + id                  = (known after apply)
      + name                = "Devops-VM-Dependencies-FQDNs"
      + priority            = 202
      + resource_group_name = (known after apply)

      + rule {
          + name             = "allow-azure-ad-join"
          + source_addresses = [
              + "10.240.10.128/26",
            ]
          + target_fqdns     = [
              + "enterpriseregistration.windows.net",
              + "pas.windows.net",
              + "login.microsoftonline.com",
              + "device.login.microsoftonline.com",
              + "autologon.microsoftazuread-sso.com",
              + "manage-beta.microsoft.com",
              + "manage.microsoft.com",
              + "aadcdn.msauth.net",
              + "aadcdn.msftauth.net",
              + "aadcdn.msftauthimages.net",
              + "*.wns.windows.com",
              + "*.sts.microsoft.com",
              + "*.manage-beta.microsoft.com",
              + "*.manage.microsoft.com",
            ]

          + protocol {
              + port = 443
              + type = "Https"
            }
        }
      + rule {
          + name             = "allow-vm-dependencies-and-tools"
          + source_addresses = [
              + "10.240.10.128/26",
            ]
          + target_fqdns     = [
              + "aka.ms",
              + "go.microsoft.com",
              + "download.microsoft.com",
              + "edge.microsoft.com",
              + "fs.microsoft.com",
              + "wdcp.microsoft.com",
              + "wdcpalt.microsoft.com",
              + "msedge.api.cdp.microsoft.com",
              + "winatp-gw-cane.microsoft.com",
              + "*.google.com",
              + "*.live.com",
              + "*.bing.com",
              + "*.msappproxy.net",
              + "*.delivery.mp.microsoft.com",
              + "*.data.microsoft.com",
              + "*.blob.storage.azure.net",
              + "*.blob.core.windows.net",
              + "*.dl.delivery.mp.microsoft.com",
              + "*.prod.do.dsp.mp.microsoft.com",
              + "*.update.microsoft.com",
              + "*.windowsupdate.com",
              + "*.apps.qualys.com",
              + "*.bootstrapcdn.com",
              + "*.jsdelivr.net",
              + "*.jquery.com",
              + "*.msecnd.net",
            ]

          + protocol {
              + port = 443
              + type = "Https"
            }
        }
    }

  # module.firewall[0].azurerm_firewall_network_rule_collection.windows_vm_devops will be created
  + resource "azurerm_firewall_network_rule_collection" "windows_vm_devops" {
      + action              = "Allow"
      + azure_firewall_name = (known after apply)
      + id                  = (known after apply)
      + name                = "Windows-VM-Connectivity-Requirements"
      + priority            = 202
      + resource_group_name = (known after apply)

      + rule {
          + destination_addresses = [
              + "20.118.99.224",
              + "40.83.235.53",
              + "23.102.135.246",
              + "51.4.143.248",
              + "23.97.0.13",
              + "52.126.105.2",
            ]
          + destination_ports     = [
              + "*",
            ]
          + name                  = "allow-kms-activation"
          + protocols             = [
              + "TCP",
              + "UDP",
            ]
          + source_addresses      = [
              + "10.240.10.128/26",
            ]
        }
      + rule {
          + destination_addresses = [
              + "*",
            ]
          + destination_ports     = [
              + "123",
            ]
          + name                  = "allow-ntp"
          + protocols             = [
              + "TCP",
              + "UDP",
            ]
          + source_addresses      = [
              + "10.240.10.128/26",
            ]
        }
    }

  # module.firewall[0].azurerm_log_analytics_workspace.law[0] must be replaced
-/+ resource "azurerm_log_analytics_workspace" "law" {
      - cmk_for_query_forced            = false -> null
      ~ id                              = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.OperationalInsights/workspaces/sec-baseline-1-hub-westus3-log-eslz2" -> (known after apply)
      ~ location                        = "westus3" -> "westus2" # forces replacement
      ~ name                            = "sec-baseline-1-hub-westus3-log-eslz2" # forces replacement -> (known after apply) # forces replacement
      ~ primary_shared_key              = (sensitive value)
      ~ resource_group_name             = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement
      ~ retention_in_days               = 30 -> (known after apply)
      ~ secondary_shared_key            = (sensitive value)
      - tags                            = {} -> null
      ~ workspace_id                    = "1078050b-bb19-4c6a-b738-dcd477a290a6" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.firewall[0].azurerm_monitor_diagnostic_setting.this must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "this" {
      ~ id                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2|sec-baseline-1-hub-westus3-fw-eslz2-diagnostic-settings" -> (known after apply)
      ~ log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)
      ~ log_analytics_workspace_id     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.OperationalInsights/workspaces/sec-baseline-1-hub-westus3-log-eslz2" -> (known after apply)
      ~ name                           = "sec-baseline-1-hub-westus3-fw-eslz2-diagnostic-settings" # forces replacement -> (known after apply) # forces replacement
      ~ target_resource_id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2" # forces replacement -> (known after apply) # forces replacement

      - log {
          - category_group = "allLogs" -> null
          - enabled        = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.firewall[0].azurerm_public_ip.firewall_pip must be replaced
-/+ resource "azurerm_public_ip" "firewall_pip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/publicIPAddresses/sec-baseline-1-hub-westus3-pip-eslz2-fw" -> (known after apply)
      ~ ip_address              = "20.25.176.182" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ location                = "westus3" -> "westus2" # forces replacement
      ~ name                    = "sec-baseline-1-hub-westus3-pip-eslz2-fw" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name     = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement
        tags                    = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "firewall"
        }
      - zones                   = [] -> null
        # (6 unchanged attributes hidden)
    }

  # module.network.azurecaf_name.caf_name_vnet must be replaced
-/+ resource "azurecaf_name" "caf_name_vnet" {
      ~ id            = "pvwuveykntdcxsyc" -> (known after apply)
        name          = "eslz2"
      ~ prefixes      = [ # forces replacement
            "sec-baseline-1-hub",
          - "westus3",
          + "wus2",
        ]
      ~ result        = "sec-baseline-1-hub-westus3-vnet-eslz2-prod" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.network.azurerm_subnet.this[0] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureFirewallSubnet" -> (known after apply)
        name                                           = "AzureFirewallSubnet"
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "sec-baseline-1-hub-westus3-vnet-eslz2-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_subnet.this[1] must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureBastionSubnet" -> (known after apply)
        name                                           = "AzureBastionSubnet"
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "sec-baseline-1-hub-westus3-vnet-eslz2-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.network.azurerm_virtual_network.this must be replaced
-/+ resource "azurerm_virtual_network" "this" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "67186602-4a08-41e1-a5df-acc468e04a1e" -> (known after apply)
      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod" -> (known after apply)
      ~ location                = "westus3" -> "westus2" # forces replacement
      ~ name                    = "sec-baseline-1-hub-westus3-vnet-eslz2-prod" # forces replacement -> (known after apply) # forces replacement
      ~ resource_group_name     = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement
      ~ subnet                  = [
          - {
              - address_prefix = "10.242.0.0/26"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureFirewallSubnet"
              - name           = "AzureFirewallSubnet"
              - security_group = ""
            },
          - {
              - address_prefix = "10.242.0.64/26"
              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureBastionSubnet"
              - name           = "AzureBastionSubnet"
              - security_group = ""
            },
        ] -> (known after apply)
        tags                    = {
            "Environment" = "prod"
            "Owner"       = "cloudops@contoso.com"
            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"
            "Terraform"   = "true"
            "module"      = "network"
        }
        # (1 unchanged attribute hidden)
    }

Plan: 21 to add, 0 to change, 17 to destroy.

Changes to Outputs:
  ~ bastion_name        = "sec-baseline-1-hub-westus3-vnet-eslz2" -> (known after apply)
  ~ firewall_private_ip = "10.242.0.4" -> (known after apply)
  ~ firewall_rules      = {
      ~ azure_monitor         = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Azure-Monitor-FQDNs" -> (known after apply)
      ~ core                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Core-Dependencies-FQDNs" -> (known after apply)
      ~ windows_vm_devops     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Devops-VM-Dependencies-FQDNs" -> (known after apply)
      ~ windows_vm_devops_net = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/networkRuleCollections/Windows-VM-Connectivity-Requirements" -> (known after apply)
    }
  ~ rg_name             = "sec-baseline-1-hub-westus3-rg-eslz2" -> (known after apply)
  ~ vnet_id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod" -> (known after apply)
  ~ vnet_name           = "sec-baseline-1-hub-westus3-vnet-eslz2-prod" -> (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.firewall[0].azurerm_firewall_application_rule_collection.azure_monitor has been deleted%0A  - resource "azurerm_firewall_application_rule_collection" "azure_monitor" {%0A      - id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Azure-Monitor-FQDNs" -> null%0A        name                = "Azure-Monitor-FQDNs"%0A        # (4 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_application_rule_collection.core has been deleted%0A  - resource "azurerm_firewall_application_rule_collection" "core" {%0A      - id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Core-Dependencies-FQDNs" -> null%0A        name                = "Core-Dependencies-FQDNs"%0A        # (4 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_application_rule_collection.windows_vm_devops has been deleted%0A  - resource "azurerm_firewall_application_rule_collection" "windows_vm_devops" {%0A      - id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Devops-VM-Dependencies-FQDNs" -> null%0A        name                = "Devops-VM-Dependencies-FQDNs"%0A        # (4 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_network_rule_collection.windows_vm_devops has been deleted%0A  - resource "azurerm_firewall_network_rule_collection" "windows_vm_devops" {%0A      - id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/networkRuleCollections/Windows-VM-Connectivity-Requirements" -> null%0A        name                = "Windows-VM-Connectivity-Requirements"%0A        # (4 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # azurecaf_name.caf_name_hub_rg must be replaced%0A-/+ resource "azurecaf_name" "caf_name_hub_rg" {%0A      ~ id            = "akckvaegwemunepv" -> (known after apply)%0A        name          = "eslz2"%0A      ~ prefixes      = [ # forces replacement%0A            "sec-baseline-1-hub",%0A          - "westus3",%0A          + "wus2",%0A        ]%0A      ~ result        = "sec-baseline-1-hub-westus3-rg-eslz2" -> (known after apply)%0A      ~ results       = {} -> (known after apply)%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # azurerm_resource_group.hub must be replaced%0A-/+ resource "azurerm_resource_group" "hub" {%0A      ~ id       = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2" -> (known after apply)%0A      ~ location = "westus3" -> "westus2" # forces replacement%0A      ~ name     = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement%0A        tags     = {%0A            "Environment" = "prod"%0A            "Owner"       = "cloudops@contoso.com"%0A            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A            "Terraform"   = "true"%0A        }%0A    }%0A%0A  # module.bastion[0].azurecaf_name.caf_name_bastion must be replaced%0A-/+ resource "azurecaf_name" "caf_name_bastion" {%0A      ~ id            = "wbujomtsfcqdpxod" -> (known after apply)%0A        name          = "eslz2"%0A      ~ prefixes      = [ # forces replacement%0A            "sec-baseline-1-hub",%0A          - "westus3",%0A          + "wus2",%0A        ]%0A      ~ result        = "sec-baseline-1-hub-westus3-vnet-eslz2" -> (known after apply)%0A      ~ results       = {} -> (known after apply)%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.bastion[0].azurecaf_name.caf_name_pip must be replaced%0A-/+ resource "azurecaf_name" "caf_name_pip" {%0A      ~ id            = "paqdxwmbugcxjhhq" -> (known after apply)%0A        name          = "eslz2-bastion"%0A      ~ prefixes      = [ # forces replacement%0A            "sec-baseline-1-hub",%0A          - "westus3",%0A          + "wus2",%0A        ]%0A      ~ result        = "sec-baseline-1-hub-westus3-pip-eslz2-bastion" -> (known after apply)%0A      ~ results       = {} -> (known after apply)%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.bastion[0].azurerm_bastion_host.bastion must be replaced%0A-/+ resource "azurerm_bastion_host" "bastion" {%0A      ~ dns_name               = "bst-17852899-7610-4883-86ff-84a3a485f96f.bastion.azure.com" -> (known after apply)%0A      ~ id                     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/bastionHosts/sec-baseline-1-hub-westus3-vnet-eslz2" -> (known after apply)%0A      ~ location               = "westus3" -> "westus2" # forces replacement%0A      ~ name                   = "sec-baseline-1-hub-westus3-vnet-eslz2" # forces replacement -> (known after apply) # forces replacement%0A      ~ resource_group_name    = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement%0A        tags                   = {%0A            "Environment" = "prod"%0A            "Owner"       = "cloudops@contoso.com"%0A            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A            "Terraform"   = "true"%0A            "module"      = "bastion"%0A        }%0A        # (7 unchanged attributes hidden)%0A%0A      ~ ip_configuration {%0A            name                 = "bastionHostIpConfiguration"%0A          ~ public_ip_address_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/publicIPAddresses/sec-baseline-1-hub-westus3-pip-eslz2-bastion" # forces replacement -> (known after apply) # forces replacement%0A          ~ subnet_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureBastionSubnet" # forces replacement -> (known after apply) # forces replacement%0A        }%0A    }%0A%0A  # module.bastion[0].azurerm_public_ip.bastion_pip must be replaced%0A-/+ resource "azurerm_public_ip" "bastion_pip" {%0A      + fqdn                    = (known after apply)%0A      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/publicIPAddresses/sec-baseline-1-hub-westus3-pip-eslz2-bastion" -> (known after apply)%0A      ~ ip_address              = "20.163.49.112" -> (known after apply)%0A      - ip_tags                 = {} -> null%0A      ~ location                = "westus3" -> "westus2" # forces replacement%0A      ~ name                    = "sec-baseline-1-hub-westus3-pip-eslz2-bastion" # forces replacement -> (known after apply) # forces replacement%0A      ~ resource_group_name     = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement%0A        tags                    = {%0A            "Environment" = "prod"%0A            "Owner"       = "cloudops@contoso.com"%0A            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A            "Terraform"   = "true"%0A            "module"      = "bastion"%0A        }%0A      - zones                   = [] -> null%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.firewall[0].azurecaf_name.caf_name_firewall must be replaced%0A-/+ resource "azurecaf_name" "caf_name_firewall" {%0A      ~ id            = "dtqvqxowbnalaruk" -> (known after apply)%0A        name          = "eslz2"%0A      ~ prefixes      = [ # forces replacement%0A            "sec-baseline-1-hub",%0A          - "westus3",%0A          + "wus2",%0A        ]%0A      ~ result        = "sec-baseline-1-hub-westus3-fw-eslz2" -> (known after apply)%0A      ~ results       = {} -> (known after apply)%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.firewall[0].azurecaf_name.caf_name_law[0] must be replaced%0A-/+ resource "azurecaf_name" "caf_name_law" {%0A      ~ id            = "lofxpwfygywepldl" -> (known after apply)%0A        name          = "eslz2"%0A      ~ prefixes      = [ # forces replacement%0A            "sec-baseline-1-hub",%0A          - "westus3",%0A          + "wus2",%0A        ]%0A      ~ result        = "sec-baseline-1-hub-westus3-log-eslz2" -> (known after apply)%0A      ~ results       = {} -> (known after apply)%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.firewall[0].azurecaf_name.caf_name_pip must be replaced%0A-/+ resource "azurecaf_name" "caf_name_pip" {%0A      ~ id            = "ofhucdctoijllhdb" -> (known after apply)%0A        name          = "eslz2-fw"%0A      ~ prefixes      = [ # forces replacement%0A            "sec-baseline-1-hub",%0A          - "westus3",%0A          + "wus2",%0A        ]%0A      ~ result        = "sec-baseline-1-hub-westus3-pip-eslz2-fw" -> (known after apply)%0A      ~ results       = {} -> (known after apply)%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.firewall[0].azurerm_firewall.firewall must be replaced%0A-/+ resource "azurerm_firewall" "firewall" {%0A      - dns_servers         = [] -> null%0A      ~ id                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2" -> (known after apply)%0A      ~ location            = "westus3" -> "westus2" # forces replacement%0A      ~ name                = "sec-baseline-1-hub-westus3-fw-eslz2" # forces replacement -> (known after apply) # forces replacement%0A      - private_ip_ranges   = [] -> null%0A      ~ resource_group_name = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement%0A        tags                = {%0A            "Environment" = "prod"%0A            "Owner"       = "cloudops@contoso.com"%0A            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A            "Terraform"   = "true"%0A            "module"      = "firewall"%0A        }%0A      ~ threat_intel_mode   = "Alert" -> (known after apply)%0A      - zones               = [] -> null%0A        # (2 unchanged attributes hidden)%0A%0A      ~ ip_configuration {%0A            name                 = "firewallIpConfiguration"%0A          ~ private_ip_address   = "10.242.0.4" -> (known after apply)%0A          ~ public_ip_address_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/publicIPAddresses/sec-baseline-1-hub-westus3-pip-eslz2-fw" -> (known after apply)%0A          ~ subnet_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureFirewallSubnet" # forces replacement -> (known after apply) # forces replacement%0A        }%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_application_rule_collection.azure_monitor will be created%0A  + resource "azurerm_firewall_application_rule_collection" "azure_monitor" {%0A      + action              = "Allow"%0A      + azure_firewall_name = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "Azure-Monitor-FQDNs"%0A      + priority            = 201%0A      + resource_group_name = (known after apply)%0A%0A      + rule {%0A          + name             = "allow-azure-monitor"%0A          + source_addresses = [%0A              + "10.242.0.0/20",%0A              + "10.240.0.0/20",%0A            ]%0A          + target_fqdns     = [%0A              + "dc.applicationinsights.azure.com",%0A              + "dc.applicationinsights.microsoft.com",%0A              + "dc.services.visualstudio.com",%0A              + "*.in.applicationinsights.azure.com",%0A              + "live.applicationinsights.azure.com",%0A              + "rt.applicationinsights.microsoft.com",%0A              + "rt.services.visualstudio.com",%0A              + "*.livediagnostics.monitor.azure.com",%0A              + "*.monitoring.azure.com",%0A              + "agent.azureserviceprofiler.net",%0A              + "*.agent.azureserviceprofiler.net",%0A              + "*.monitor.azure.com",%0A            ]%0A%0A          + protocol {%0A              + port = 443%0A              + type = "Https"%0A            }%0A        }%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_application_rule_collection.core will be created%0A  + resource "azurerm_firewall_application_rule_collection" "core" {%0A      + action              = "Allow"%0A      + azure_firewall_name = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "Core-Dependencies-FQDNs"%0A      + priority            = 200%0A      + resource_group_name = (known after apply)%0A%0A      + rule {%0A          + name             = "allow-core-apis"%0A          + source_addresses = [%0A              + "10.242.0.0/20",%0A              + "10.240.0.0/20",%0A            ]%0A          + target_fqdns     = [%0A              + "management.azure.com",%0A              + "management.core.windows.net",%0A              + "login.microsoftonline.com",%0A              + "login.windows.net",%0A              + "login.live.com",%0A              + "graph.windows.net",%0A              + "graph.microsoft.com",%0A            ]%0A%0A          + protocol {%0A              + port = 443%0A              + type = "Https"%0A            }%0A        }%0A      + rule {%0A          + name             = "allow-developer-services"%0A          + source_addresses = [%0A              + "10.242.0.0/20",%0A              + "10.240.0.0/20",%0A            ]%0A          + target_fqdns     = [%0A              + "github.com",%0A              + "*.github.com",%0A              + "*.nuget.org",%0A              + "*.blob.core.windows.net",%0A              + "*.githubusercontent.com",%0A              + "dev.azure.com",%0A              + "*.dev.azure.com",%0A              + "portal.azure.com",%0A              + "*.portal.azure.com",%0A              + "*.portal.azure.net",%0A              + "appservice.azureedge.net",%0A              + "*.azurewebsites.net",%0A              + "edge.management.azure.com",%0A              + "vstsagentpackage.azureedge.net",%0A            ]%0A%0A          + protocol {%0A              + port = 443%0A              + type = "Https"%0A            }%0A        }%0A      + rule {%0A          + name             = "allow-certificate-dependencies"%0A          + source_addresses = [%0A              + "10.242.0.0/20",%0A              + "10.240.0.0/20",%0A            ]%0A          + target_fqdns     = [%0A              + "*.delivery.mp.microsoft.com",%0A              + "ctldl.windowsupdate.com",%0A              + "download.windowsupdate.com",%0A              + "mscrl.microsoft.com",%0A              + "ocsp.msocsp.com",%0A              + "oneocsp.microsoft.com",%0A              + "crl.microsoft.com",%0A              + "www.microsoft.com",%0A              + "*.digicert.com",%0A              + "*.symantec.com",%0A              + "*.symcb.com",%0A              + "*.d-trust.net",%0A            ]%0A%0A          + protocol {%0A              + port = 80%0A              + type = "Http"%0A            }%0A        }%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_application_rule_collection.windows_vm_devops will be created%0A  + resource "azurerm_firewall_application_rule_collection" "windows_vm_devops" {%0A      + action              = "Allow"%0A      + azure_firewall_name = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "Devops-VM-Dependencies-FQDNs"%0A      + priority            = 202%0A      + resource_group_name = (known after apply)%0A%0A      + rule {%0A          + name             = "allow-azure-ad-join"%0A          + source_addresses = [%0A              + "10.240.10.128/26",%0A            ]%0A          + target_fqdns     = [%0A              + "enterpriseregistration.windows.net",%0A              + "pas.windows.net",%0A              + "login.microsoftonline.com",%0A              + "device.login.microsoftonline.com",%0A              + "autologon.microsoftazuread-sso.com",%0A              + "manage-beta.microsoft.com",%0A              + "manage.microsoft.com",%0A              + "aadcdn.msauth.net",%0A              + "aadcdn.msftauth.net",%0A              + "aadcdn.msftauthimages.net",%0A              + "*.wns.windows.com",%0A              + "*.sts.microsoft.com",%0A              + "*.manage-beta.microsoft.com",%0A              + "*.manage.microsoft.com",%0A            ]%0A%0A          + protocol {%0A              + port = 443%0A              + type = "Https"%0A            }%0A        }%0A      + rule {%0A          + name             = "allow-vm-dependencies-and-tools"%0A          + source_addresses = [%0A              + "10.240.10.128/26",%0A            ]%0A          + target_fqdns     = [%0A              + "aka.ms",%0A              + "go.microsoft.com",%0A              + "download.microsoft.com",%0A              + "edge.microsoft.com",%0A              + "fs.microsoft.com",%0A              + "wdcp.microsoft.com",%0A              + "wdcpalt.microsoft.com",%0A              + "msedge.api.cdp.microsoft.com",%0A              + "winatp-gw-cane.microsoft.com",%0A              + "*.google.com",%0A              + "*.live.com",%0A              + "*.bing.com",%0A              + "*.msappproxy.net",%0A              + "*.delivery.mp.microsoft.com",%0A              + "*.data.microsoft.com",%0A              + "*.blob.storage.azure.net",%0A              + "*.blob.core.windows.net",%0A              + "*.dl.delivery.mp.microsoft.com",%0A              + "*.prod.do.dsp.mp.microsoft.com",%0A              + "*.update.microsoft.com",%0A              + "*.windowsupdate.com",%0A              + "*.apps.qualys.com",%0A              + "*.bootstrapcdn.com",%0A              + "*.jsdelivr.net",%0A              + "*.jquery.com",%0A              + "*.msecnd.net",%0A            ]%0A%0A          + protocol {%0A              + port = 443%0A              + type = "Https"%0A            }%0A        }%0A    }%0A%0A  # module.firewall[0].azurerm_firewall_network_rule_collection.windows_vm_devops will be created%0A  + resource "azurerm_firewall_network_rule_collection" "windows_vm_devops" {%0A      + action              = "Allow"%0A      + azure_firewall_name = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "Windows-VM-Connectivity-Requirements"%0A      + priority            = 202%0A      + resource_group_name = (known after apply)%0A%0A      + rule {%0A          + destination_addresses = [%0A              + "20.118.99.224",%0A              + "40.83.235.53",%0A              + "23.102.135.246",%0A              + "51.4.143.248",%0A              + "23.97.0.13",%0A              + "52.126.105.2",%0A            ]%0A          + destination_ports     = [%0A              + "*",%0A            ]%0A          + name                  = "allow-kms-activation"%0A          + protocols             = [%0A              + "TCP",%0A              + "UDP",%0A            ]%0A          + source_addresses      = [%0A              + "10.240.10.128/26",%0A            ]%0A        }%0A      + rule {%0A          + destination_addresses = [%0A              + "*",%0A            ]%0A          + destination_ports     = [%0A              + "123",%0A            ]%0A          + name                  = "allow-ntp"%0A          + protocols             = [%0A              + "TCP",%0A              + "UDP",%0A            ]%0A          + source_addresses      = [%0A              + "10.240.10.128/26",%0A            ]%0A        }%0A    }%0A%0A  # module.firewall[0].azurerm_log_analytics_workspace.law[0] must be replaced%0A-/+ resource "azurerm_log_analytics_workspace" "law" {%0A      - cmk_for_query_forced            = false -> null%0A      ~ id                              = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.OperationalInsights/workspaces/sec-baseline-1-hub-westus3-log-eslz2" -> (known after apply)%0A      ~ location                        = "westus3" -> "westus2" # forces replacement%0A      ~ name                            = "sec-baseline-1-hub-westus3-log-eslz2" # forces replacement -> (known after apply) # forces replacement%0A      ~ primary_shared_key              = (sensitive value)%0A      ~ resource_group_name             = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement%0A      ~ retention_in_days               = 30 -> (known after apply)%0A      ~ secondary_shared_key            = (sensitive value)%0A      - tags                            = {} -> null%0A      ~ workspace_id                    = "1078050b-bb19-4c6a-b738-dcd477a290a6" -> (known after apply)%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.firewall[0].azurerm_monitor_diagnostic_setting.this must be replaced%0A-/+ resource "azurerm_monitor_diagnostic_setting" "this" {%0A      ~ id                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2|sec-baseline-1-hub-westus3-fw-eslz2-diagnostic-settings" -> (known after apply)%0A      ~ log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)%0A      ~ log_analytics_workspace_id     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.OperationalInsights/workspaces/sec-baseline-1-hub-westus3-log-eslz2" -> (known after apply)%0A      ~ name                           = "sec-baseline-1-hub-westus3-fw-eslz2-diagnostic-settings" # forces replacement -> (known after apply) # forces replacement%0A      ~ target_resource_id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2" # forces replacement -> (known after apply) # forces replacement%0A%0A      - log {%0A          - category_group = "allLogs" -> null%0A          - enabled        = true -> null%0A%0A          - retention_policy {%0A              - days    = 0 -> null%0A              - enabled = false -> null%0A            }%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.firewall[0].azurerm_public_ip.firewall_pip must be replaced%0A-/+ resource "azurerm_public_ip" "firewall_pip" {%0A      + fqdn                    = (known after apply)%0A      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/publicIPAddresses/sec-baseline-1-hub-westus3-pip-eslz2-fw" -> (known after apply)%0A      ~ ip_address              = "20.25.176.182" -> (known after apply)%0A      - ip_tags                 = {} -> null%0A      ~ location                = "westus3" -> "westus2" # forces replacement%0A      ~ name                    = "sec-baseline-1-hub-westus3-pip-eslz2-fw" # forces replacement -> (known after apply) # forces replacement%0A      ~ resource_group_name     = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement%0A        tags                    = {%0A            "Environment" = "prod"%0A            "Owner"       = "cloudops@contoso.com"%0A            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A            "Terraform"   = "true"%0A            "module"      = "firewall"%0A        }%0A      - zones                   = [] -> null%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.network.azurecaf_name.caf_name_vnet must be replaced%0A-/+ resource "azurecaf_name" "caf_name_vnet" {%0A      ~ id            = "pvwuveykntdcxsyc" -> (known after apply)%0A        name          = "eslz2"%0A      ~ prefixes      = [ # forces replacement%0A            "sec-baseline-1-hub",%0A          - "westus3",%0A          + "wus2",%0A        ]%0A      ~ result        = "sec-baseline-1-hub-westus3-vnet-eslz2-prod" -> (known after apply)%0A      ~ results       = {} -> (known after apply)%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.network.azurerm_subnet.this[0] must be replaced%0A-/+ resource "azurerm_subnet" "this" {%0A      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)%0A      ~ enforce_private_link_service_network_policies  = false -> (known after apply)%0A      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureFirewallSubnet" -> (known after apply)%0A        name                                           = "AzureFirewallSubnet"%0A      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)%0A      ~ private_link_service_network_policies_enabled  = true -> (known after apply)%0A      ~ resource_group_name                            = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement%0A      - service_endpoint_policy_ids                    = [] -> null%0A      - service_endpoints                              = [] -> null%0A      ~ virtual_network_name                           = "sec-baseline-1-hub-westus3-vnet-eslz2-prod" # forces replacement -> (known after apply) # forces replacement%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.network.azurerm_subnet.this[1] must be replaced%0A-/+ resource "azurerm_subnet" "this" {%0A      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)%0A      ~ enforce_private_link_service_network_policies  = false -> (known after apply)%0A      ~ id                                             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureBastionSubnet" -> (known after apply)%0A        name                                           = "AzureBastionSubnet"%0A      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)%0A      ~ private_link_service_network_policies_enabled  = true -> (known after apply)%0A      ~ resource_group_name                            = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement%0A      - service_endpoint_policy_ids                    = [] -> null%0A      - service_endpoints                              = [] -> null%0A      ~ virtual_network_name                           = "sec-baseline-1-hub-westus3-vnet-eslz2-prod" # forces replacement -> (known after apply) # forces replacement%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.network.azurerm_virtual_network.this must be replaced%0A-/+ resource "azurerm_virtual_network" "this" {%0A      ~ dns_servers             = [] -> (known after apply)%0A      - flow_timeout_in_minutes = 0 -> null%0A      ~ guid                    = "67186602-4a08-41e1-a5df-acc468e04a1e" -> (known after apply)%0A      ~ id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod" -> (known after apply)%0A      ~ location                = "westus3" -> "westus2" # forces replacement%0A      ~ name                    = "sec-baseline-1-hub-westus3-vnet-eslz2-prod" # forces replacement -> (known after apply) # forces replacement%0A      ~ resource_group_name     = "sec-baseline-1-hub-westus3-rg-eslz2" # forces replacement -> (known after apply) # forces replacement%0A      ~ subnet                  = [%0A          - {%0A              - address_prefix = "10.242.0.0/26"%0A              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureFirewallSubnet"%0A              - name           = "AzureFirewallSubnet"%0A              - security_group = ""%0A            },%0A          - {%0A              - address_prefix = "10.242.0.64/26"%0A              - id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod/subnets/AzureBastionSubnet"%0A              - name           = "AzureBastionSubnet"%0A              - security_group = ""%0A            },%0A        ] -> (known after apply)%0A        tags                    = {%0A            "Environment" = "prod"%0A            "Owner"       = "cloudops@contoso.com"%0A            "Project"     = "[Scenario 1: HUB] App Service Landing Zone Accelerator"%0A            "Terraform"   = "true"%0A            "module"      = "network"%0A        }%0A        # (1 unchanged attribute hidden)%0A    }%0A%0APlan: 21 to add, 0 to change, 17 to destroy.%0A%0AChanges to Outputs:%0A  ~ bastion_name        = "sec-baseline-1-hub-westus3-vnet-eslz2" -> (known after apply)%0A  ~ firewall_private_ip = "10.242.0.4" -> (known after apply)%0A  ~ firewall_rules      = {%0A      ~ azure_monitor         = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Azure-Monitor-FQDNs" -> (known after apply)%0A      ~ core                  = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Core-Dependencies-FQDNs" -> (known after apply)%0A      ~ windows_vm_devops     = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/applicationRuleCollections/Devops-VM-Dependencies-FQDNs" -> (known after apply)%0A      ~ windows_vm_devops_net = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/azureFirewalls/sec-baseline-1-hub-westus3-fw-eslz2/networkRuleCollections/Windows-VM-Connectivity-Requirements" -> (known after apply)%0A    }%0A  ~ rg_name             = "sec-baseline-1-hub-westus3-rg-eslz2" -> (known after apply)%0A  ~ vnet_id             = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/sec-baseline-1-hub-westus3-rg-eslz2/providers/Microsoft.Network/virtualNetworks/sec-baseline-1-hub-westus3-vnet-eslz2-prod" -> (known after apply)%0A  ~ vnet_name           = "sec-baseline-1-hub-westus3-vnet-eslz2-prod" -> (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @JinLee794, Action: `pull_request`, Working Directory: `scenarios/secure-baseline-multitenant/terraform/hub`, Workflow: `Scenario 1: Terraform HUB Multi-tenant Secure Baseline`*